Data Source: https://www.kaggle.com/datasets/rtatman/english-word-frequency.

Data files were derived from the Google Web Trillion Word Corpus.

In [19]:
import pandas as pd

In [20]:
df = pd.read_csv("unigram_freq.csv")

In [21]:
df.head(10)

   word        count
0   the  23135851162
1    of  13151942776
2   and  12997637966
3    to  12136980858
4     a   9081174698
5    in   8469404971
6   for   5933321709
7    is   4705743816
8    on   3750423199
9  that   3400031103

In [5]:
df[df["word"] == "google"]

       word     count
948  google  84568679

In [24]:
df[df["word"] == "shoe"]

      word     count
4273  shoe  16342426

In [6]:
df.iloc[0:30000]

              word        count
0              the  23135851162
1               of  13151942776
2              and  12997637966
3               to  12136980858
4                a   9081174698
...            ...          ...
29995    persisted       796385
29996          mdi       796367
29997      nilsson       796316
29998  whereabouts       796302
29999    substring       796291

[30000 rows x 2 columns]

In [7]:
df[df['word'] == 'large']

      word      count
461  large  165863763

In [8]:
df[df['word'] == 'google']

       word     count
948  google  84568679

In [9]:
df[df['word'] == 'apple']

       word     count
1642  apple  50551171

In [10]:
df[df['word'] == 'banana']

        word    count
9396  banana  5567941

In [16]:
df[df['word'] == 'coke']

       word    count
12558  coke  3505322

In [18]:
def save_topk_csv(df, topk):
    topk_df = df.iloc[0:topk]
    topk_df.to_csv(f"{topk}_freq.csv")

In [17]:
save_topk_csv(df=df, topk=30000)